-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /home/chl/cwd/biostats/stata/hand01.log
  log type:  text
 opened on:  11 Feb 2023, 13:33:39

. 
. // genotype data
. use ../data/polymorphism, clear

. 
. describe

Contains data from ../data/polymorphism.dta
  obs:            59                          
 vars:             3                          16 Apr 2001 14:58
 size:           708                          
-------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
id              float   %9.0g                 ID Number
age             float   %9.0g                 Age at Diagnosis
genotype        float   %9.0g      rflp       Genotype
-------------------------------------------------------------------------------
Sorted by:  genotype  age

. 
. tabulate genotype, summarize(age)

            |     Summary of Age at Diagnosis
   Genotype |        Mean   Std. Dev.       Freq.
------------+------------------------------------
    1.6/1.6 |   64.642857   11.181077          14
    1.6/0.7 |    64.37931   13.259535          29
    0.7/0.7 |      50.375   10.638766          16
------------+------------------------------------
      Total |   60.644068   13.494268          59

. 
. graph twoway histogram age, by(genotype, col(3) legend(off)) ///
>   freq bfcolor(gs3) blcolor(none)

. graph export "figs/fig-01-01.eps", replace
(file figs/fig-01-01.eps written in EPS format)

. 
. oneway age genotype, bonferroni

                        Analysis of Variance
    Source              SS         df      MS            F     Prob > F
------------------------------------------------------------------------
Between groups      2315.73355      2   1157.86678      7.86     0.0010
 Within groups      8245.79187     56   147.246283
------------------------------------------------------------------------
    Total           10561.5254     58   182.095266

Bartlett's test for equal variances:  chi2(2) =   1.0798  Prob>chi2 = 0.583

                  Comparison of Age at Diagnosis by Genotype
                                (Bonferroni)
Row Mean-|
Col Mean |    1.6/1.6    1.6/0.7
---------+----------------------
 1.6/0.7 |   -.263547
         |      1.000
         |
 0.7/0.7 |   -14.2679   -14.0043
         |      0.007      0.001

. 
. quietly anova age genotype

. anovaplot, scatter(jitter(2))

. graph export "figs/fig-01-02.eps", replace
(file figs/fig-01-02.eps written in EPS format)

. 
. regress age i.genotype

      Source |       SS       df       MS              Number of obs =      59
-------------+------------------------------           F(  2,    56) =    7.86
       Model |  2315.73355     2  1157.86678           Prob > F      =  0.0010
    Residual |  8245.79187    56  147.246283           R-squared     =  0.2193
-------------+------------------------------           Adj R-squared =  0.1914
       Total |  10561.5254    58  182.095266           Root MSE      =  12.135

------------------------------------------------------------------------------
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    genotype |
    1.6/0.7  |  -.2635468   3.949057    -0.07   0.947    -8.174458    7.647365
    0.7/0.7  |  -14.26786   4.440775    -3.21   0.002     -23.1638   -5.371915
             |
       _cons |   64.64286   3.243084    19.93   0.000     58.14618    71.13953
------------------------------------------------------------------------------

. 
. // weight data
. import delimited ../data/weight.dat, delimiter(space, collapse) ///
>   varnames(nonames) clear
(4 vars, 10 obs)

. 
. xpose, clear

. gen id = _n

. reshape long v, i(id)
(note: j = 1 2 3 4 5 6 7 8 9 10)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        4   ->      40
Number of variables                  11   ->       3
j variable (10 values)                    ->   _j
xij variables:
                          v1 v2 ... v10   ->   v
-----------------------------------------------------------------------------

. egen type = seq(), t(2) b(20)

. label define type 1 "Beef" 2 "Cereal"

. label values type type

. egen level = seq(), t(2) b(10)

. label define level 1 "Low" 2 "High"

. label values level level

. drop id _j

. rename v weight

. 
. list in 1/5

     +-----------------------+
     | weight   type   level |
     |-----------------------|
  1. |     90   Beef     Low |
  2. |     76   Beef     Low |
  3. |     90   Beef     Low |
  4. |     64   Beef     Low |
  5. |     86   Beef     Low |
     +-----------------------+

. 
. graph box weight, over(type) over(level)

. graph export "figs/fig-01-03.eps", replace
(file figs/fig-01-03.eps written in EPS format)

. 
. quietly anova weight type level type#level

. anovaplot level type, scatter(ms(i)) yscale(r(75 105))

. graph export "figs/fig-01-04.eps", replace
(file figs/fig-01-04.eps written in EPS format)

. 
. preserve

. statsby, by(type level) clear: ci weight
(running ci on estimation sample)

      command:  ci weight
           ub:  r(ub)
           lb:  r(lb)
           se:  r(se)
         mean:  r(mean)
            N:  r(N)
           by:  type level

Statsby groups
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
....

. list

     +-------------------------------------------------------------+
     |   type   level         ub         lb         se   mean    N |
     |-------------------------------------------------------------|
  1. |   Beef     Low   89.13405   69.26595   4.391406   79.2   10 |
  2. |   Beef    High   110.8279   89.17206   4.786555    100   10 |
  3. | Cereal     Low   95.13741    72.6626   4.967561   83.9   10 |
  4. | Cereal    High   96.64597   75.15402   4.750321   85.9   10 |
     +-------------------------------------------------------------+

. restore

. 
. anova weight type level type#level

                           Number of obs =      40     R-squared     =  0.2300
                           Root MSE      = 14.9531     Adj R-squared =  0.1658

                  Source |  Partial SS    df       MS           F     Prob > F
              -----------+----------------------------------------------------
                   Model |      2404.1     3  801.366667       3.58     0.0230
                         |
                    type |       220.9     1       220.9       0.99     0.3269
                   level |      1299.6     1      1299.6       5.81     0.0211
              type#level |       883.6     1       883.6       3.95     0.0545
                         |
                Residual |      8049.4    36  223.594444   
              -----------+----------------------------------------------------
                   Total |     10453.5    39  268.038462   

. estimates store m1

. anova weight type level

                           Number of obs =      40     R-squared     =  0.1455
                           Root MSE      = 15.5381     Adj R-squared =  0.0993

                  Source |  Partial SS    df       MS           F     Prob > F
              -----------+----------------------------------------------------
                   Model |      1520.5     2      760.25       3.15     0.0546
                         |
                    type |       220.9     1       220.9       0.91     0.3450
                   level |      1299.6     1      1299.6       5.38     0.0260
                         |
                Residual |        8933    37  241.432432   
              -----------+----------------------------------------------------
                   Total |     10453.5    39  268.038462   

. estimates store m2

. estimates stats m1 m2

Akaike's information criterion and Bayesian information criterion

-----------------------------------------------------------------------------
       Model |    Obs    ll(null)   ll(model)     df          AIC         BIC
-------------+---------------------------------------------------------------
          m1 |     40   -168.0738    -162.847      4      333.694    340.4495
          m2 |     40   -168.0738   -164.9301      3     335.8602    340.9268
-----------------------------------------------------------------------------
               Note:  N=Obs used in calculating BIC; see [R] BIC note

. lrtest m1 m2

Likelihood-ratio test                                 LR chi2(1)  =      4.17
(Assumption: m2 nested in m1)                         Prob > chi2 =    0.0412

. 
. ttest weight, by(level)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
     Low |      20       81.55    3.271468    14.63045    74.70274    88.39726
    High |      20       92.95    3.658785    16.36259    85.29207    100.6079
---------+--------------------------------------------------------------------
combined |      40       87.25    2.588622    16.37188    82.01402    92.48598
---------+--------------------------------------------------------------------
    diff |               -11.4    4.908076               -21.33588   -1.464119
------------------------------------------------------------------------------
    diff = mean(Low) - mean(High)                                 t =  -2.3227
Ho: diff = 0                                     degrees of freedom =       38

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0128         Pr(|T| > |t|) = 0.0256          Pr(T > t) = 0.9872

. scalar tobs = r(t)^2

. display `=tobs'
5.3949464

. 
. pwmean weight, over(type level) pveffects mcompare(bonf)

Pairwise comparisons of means with equal variances

over         : type level

---------------------------
             |    Number of
             |  Comparisons
-------------+-------------
  type#level |            6
---------------------------

-----------------------------------------------------------------------
                               |                            Bonferroni
                        weight |   Contrast   Std. Err.      t    P>|t|
-------------------------------+---------------------------------------
                    type#level |
    (Beef#High) vs (Beef#Low)  |       20.8   6.687218     3.11   0.022
   (Cereal#Low) vs (Beef#Low)  |        4.7   6.687218     0.70   1.000
  (Cereal#High) vs (Beef#Low)  |        6.7   6.687218     1.00   1.000
  (Cereal#Low) vs (Beef#High)  |      -16.1   6.687218    -2.41   0.128
 (Cereal#High) vs (Beef#High)  |      -14.1   6.687218    -2.11   0.252
(Cereal#High) vs (Cereal#Low)  |          2   6.687218     0.30   1.000
-----------------------------------------------------------------------

. 
. egen tx = concat(type level), decode punct(.)

. graph box weight, over(tx) b1title("Treatment (Diet type x Diet level)")

. graph export "figs/fig-01-05.eps", replace
(file figs/fig-01-05.eps written in EPS format)

. 
. pwmean weight, over(type level) pveffects mcompare(tukey)

Pairwise comparisons of means with equal variances

over         : type level

---------------------------
             |    Number of
             |  Comparisons
-------------+-------------
  type#level |            6
---------------------------

-----------------------------------------------------------------------
                               |                              Tukey
                        weight |   Contrast   Std. Err.      t    P>|t|
-------------------------------+---------------------------------------
                    type#level |
    (Beef#High) vs (Beef#Low)  |       20.8   6.687218     3.11   0.018
   (Cereal#Low) vs (Beef#Low)  |        4.7   6.687218     0.70   0.895
  (Cereal#High) vs (Beef#Low)  |        6.7   6.687218     1.00   0.749
  (Cereal#Low) vs (Beef#High)  |      -16.1   6.687218    -2.41   0.094
 (Cereal#High) vs (Beef#High)  |      -14.1   6.687218    -2.11   0.170
(Cereal#High) vs (Cereal#Low)  |          2   6.687218     0.30   0.991
-----------------------------------------------------------------------

. 
. // ToothGrowth data
. use ../data/toothgrowth, clear
(Written by R.              )

. 
. summarize

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         len |        60    18.81333    7.649315        4.2       33.9
        supp |        60         1.5    .5042195          1          2
        dose |        60    1.166667    .6288722         .5          2

. 
. egen dosec = group(dose), label

. quietly anova len dosec#supp

. quietly margins dosec#supp

. 
. marginsplot, noci recast(line) ///
>   plot1opts(lcolor(ebblue)) plot2opts(lcolor(orange)) ///
>   addplot((scatter len dosec if supp == 1, ms(oh) mcolor(ebblue) ///
>   jitter(5) text(20 1.25 "OJ", color(ebblue) size(medlarge))) ///
>   (scatter len dosec if supp == 2, ms(oh) mcolor(orange) ///
>   jitter(5) text(10 1.75 "VC", color(orange) size(medlarge)))) ///
>   ytitle(Length (oc. unit)) xtitle(Dose (mg/day)) xscale(range(0.75 3.25)) //
> /
>   title("") legend(off)

  Variables that uniquely identify margins: dosec supp

. graph export "figs/fig-01-06.eps", replace
(file figs/fig-01-06.eps written in EPS format)

. 
. quietly capture log close
